Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If either coordinate is omitted, the dialog will be centered in that dimension.
ja: どちらかの座標が省略された場合、ダイアログはその次元で中央に配置されます。

source: If either dimension is 0, the original size is used for that dimension.
ja: どちらかの寸法が0であれば、その寸法に対してオリジナルサイズが使用されます。

source: If either input is a floating point number, the result is also a floating point number.
ja: いずれかの入力が浮動小数点数である場合、結果も浮動小数点数です。

source: If either is an empty string, the current local date and time (A_Now) is used.
ja: どちらかが空文字列のときは、現在のローカル日時（A_Now）が使われます。

source: If either is omitted or blank, the size in that dimension will not be changed.
ja: どちらかが省略されるか空白の場合、その寸法のサイズは変更されない。

source: If either is omitted, 0 will be sent.
ja: どちらかを省略したときは、0を送信します。

source: If either is omitted, the control's position in that dimension will not be changed.
ja: どちらかを省略すると、その次元ではコントロールの位置は変更されません。

source: If either is omitted, the control's size in that dimension will not be changed.
ja: どちらかを省略すると、その次元ではコントロールのサイズは変更されません。

source: If either of the inputs is a floating-point number, a TypeError is thrown.
ja: 入力のどちらかが浮動小数点数のときは、TypeErrorがスローされます。

source: If either of the inputs is in floating point format, a TypeError is thrown.
ja: 入力のどちらかが浮動小数点形式の場合、TypeErrorが投げられる。

source: If either parameter is -1, the thread cannot be interrupted as a result of that parameter.
ja: いずれかのパラメータが-1の場合、そのパラメータの結果としてスレッドが中断されることはない。

source: If either parameter is 0, each newly launched thread is immediately interruptible.
ja: いずれかのパラメーターが0であれば、新しく起動されたスレッドは即座に割り込み可能となる。

source: If either parameter is an empty string, the current local date and time (A_Now) is used.
ja: いずれかのパラメータが空文字列の場合、現在のローカル日付と時刻（A_Now）が使用されます。

source: If either parameter is omitted, Control's size in that dimension will not be changed.
ja: どちらかのパラメータが省略された場合、その次元におけるコントロールのサイズは変更されません。

source: If either parameter is unset or omitted, the corresponding value will not be stored.
ja: いずれかのパラメータが未設定または省略された場合、対応する値は保存されない。

source: If either the P or \ (backslash) option is in effect, the entire item must be a duplicate, not just the substring that is used for sorting.
ja: Pオプションまたは(バックスラッシュ)オプションのいずれかが有効な場合、ソートに使用される部分文字列だけでなく、項目全体が重複していなければなりません。

source: If empty or omitted, MenuItemName will be converted into a separator line.
ja: 空または省略された場合、MenuItemNameはセパレータラインに変換されます。

source: If enabled and the system DPI setting is not 96 (100%), positions and sizes accepted by or returned from Gui methods/properties are not compatible with other functions.
ja: 有効で、システムのDPI設定が96（100％）でない場合、Guiのメソッド/プロパティで受け入れたり、そこから返したりする位置やサイズは、他の関数と互換性がありません。

source: If enabled and the system DPI setting is not 96 (100 %), positions and sizes accepted by or returned from Gui methods/properties are not compatible with other functions.
ja: 有効で、システムのDPI設定が96（100 %）でない場合、Guiのメソッド/プロパティで受け入れたり、そこから返したりする位置やサイズは、他の関数と互換性がありません。

source: If enabled, pressing the key terminates Input, sets EndReason to the word EndKey and the EndKey property to the key's normalized name.
ja: 有効な場合、キーを押すとInputが終了し、EndReasonにEndKeyという単語が、EndKeyプロパティにキーの正規化された名前が設定されます。

source: If enabled, the window will not close automatically after creating a script.
ja: 有効にすると、スクリプト作成後にウィンドウが自動的に閉じなくなる。

source: If environment variables such as %WinDir% are present in the string, one way to resolve them is via StrReplace.
ja: WinDir%などの環境変数が文字列中に存在する場合、それを解決する一つの方法として、StrReplaceを使用します。

source: If everything you try fails, it may not be possible to use AutoHotkey for your needs.
ja: 何を試してもうまくいかない場合は、AutoHotkeyを使うことができないかもしれません。

source: If false, attempting to read the variable within an expression would throw an error.
ja: false の場合、式の中で変数を読み込もうとするとエラーが発生します。

source: If false, the entirety of what the user types must match one of the MatchList phrases.
ja: Falseの場合、ユーザーが入力した内容全体が、MatchListのフレーズのいずれかに一致しなければならない。

source: If false, they are blocked.
ja: false の場合、ブロックされます。

source: If files were found, A_LastError is set to 0 (zero) or the result of the operating system's GetLastError() function immediately after the last failure.
ja: ファイルが見つかった場合、A_LastErrorには0（ゼロ）または最後の失敗の直後のオペレーティングシステムのGetLastError()関数の結果が設定されます。

source: If for some reason no matching window appears, the script will stall indefinitely.
ja: 何らかの理由で一致するウィンドウが表示されない場合、スクリプトは無期限に停止します。

source: If higher precision is needed, specify Seconds for TimeUnits and divide the result by 60.0, 3600.0, or 86400.0.
ja: より正確性が必要であれば、TimeUnitsを秒に指定してから60.0や3600.0や86400.0で割ってください。

source: If identifiable sections of that work are not derived from the Program, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works.
ja: もしその作品の特定可能な部分が『プログラム』から派生したものではなく、それ自体が独立した別個の作品であると合理的に考えられるならば、あなたがそれらを別個の作品として頒布する場合、本許諾書とその条項はそれらの部分には適用されない。

source: If in doubt, use lowercase.
ja: 迷ったときは小文字を使います。

source: If in doubt, you could send the file to the vendor of your antivirus software for confirmation.
ja: 疑わしい場合は、ウイルス対策ソフトのベンダーにファイルを送信して確認してもらうとよいでしょう。

source: If it appears before the name, the operation is performed and its result is used by the next operation (the result is a variable reference in this case).
ja: 名前の前に現れた場合、その操作は実行され、その結果は次の操作で使用される（この場合、結果は変数参照）。

source: If it does not match, characters will be decoded incorrectly.
ja: 一致しない場合、文字は正しくデコードされない。

source: If it does not, the default return value is an empty string.
ja: そうでない場合、デフォルトの戻り値は空文字列となる。

source: If it fails in such cases or for any other reason, an exception is thrown.
ja: このような場合、またはその他の理由で失敗した場合、例外がスローされます。

source: If it is 0 (false), it will contain small icons (this is the default when omitted).
ja: 0（false）を指定すると、小さなアイコンを含むようになります（省略時のデフォルトはこれ）。

source: If it is a preinstalled template, an editable copy is created instead of opening the original.
ja: プリインストールされているテンプレートの場合、オリジナルを開く代わりに編集可能なコピーが作成されます。

source: If it is negative, too few arguments were passed.
ja: 負の値であれば、渡された引数が少なすぎる。

source: If it is positive, too many arguments (or arguments that were too large) were passed, or the call requires CDecl.
ja: 正の値の場合、引数が多すぎる（または引数が大きすぎる）か、CDeclが必要な呼び出しです。

source: If it is still true, a new iteration begins; otherwise, the loop ends.
ja: まだ真であれば、新しい反復を開始し、そうでなければループを終了する。

source: If it is, remove it to prevent a double-backslash later on.
ja: もしそうなら、後で二重のバックスラッシュを防ぐため、削除してください。

source: If it is, the function is not called and a TypeError is thrown.
ja: もしそうであれば、関数は呼び出されず、TypeErrorが投げられる。

source: If it returns false (zero or an empty string), the loop terminates.
ja: false（0または空文字列）を返すと、ループは終了します。

source: If it times out, the block is skipped and execution continues after the closing brace (if there is any code after it).
ja: タイムアウトした場合、そのブロックはスキップされ、閉じ波括弧の後（その後にコードがある場合）に実行が継続されます。

source: If it was GroupDeactivate, this function will close the active window only if it is not a member of the group (otherwise it will do nothing).
ja: GroupDeactivateの場合、アクティブなウィンドウがグループのメンバーでない場合のみ閉じます（それ以外は何もしません）。

source: If it was GroupActivate or nothing, this function will close the active window only if it is a member of the group (otherwise it will do nothing).
ja: GroupActivateであった場合、または何もしなかった場合、この関数はアクティブなウィンドウがグループのメンバーである場合にのみ閉じます（そうでない場合は何もしません）。

source: If it's not in the chart, it does not need brackets.
ja: チャートになければ、括弧は必要ない。

source: If left undefined, the object cannot be passed directly to a for-loop unless it has an enumerator-compatible Call method.
ja: 未定義のままだと、列挙子と互換性のあるCallメソッドを持たない限り、オブジェクトを直接forループに渡すことはできない。

source: If less than the current number of own properties, that number is used instead, and any unused space is freed.
ja: 現在の自プロパティの数より少ない場合、その数が代わりに使用され、未使用のスペースは解放されます。

source: If more than one instance of a particular name matches something, only the leftmost one is stored.
ja: 特定の名前の複数のインスタンスが何かにマッチした場合、一番左にあるものだけが保存される。

source: If more than one option is present, separate each one from the previous with a space.
ja: 複数のオプションがある場合は、それぞれをスペースで区切る。

source: If more than one variant is eligible to fire, only the one closest to the top of the script will fire.
ja: 複数のバリアントが発射対象となる場合、スクリプトの先頭に最も近いものだけが発射されます。

source: If more than one variant of a hotkey is eligible to fire, only the one created earliest will fire.
ja: ホットキーの複数のバリエーションが発火の対象となる場合、最も早く作成されたものだけが発火します。

source: If more than one variant of a hotstring is eligible to fire, only the one created earliest will fire.
ja: ホットストリングの複数のバリアントが発火の対象となる場合、最も早く作成されたものだけが発火します。

source: If more than one word is present, separate each from the next with a space (e.g. "Alt Slow").
ja: 複数の単語がある場合は、それぞれをスペースで区切ってください（例："Alt Slow"）。

source: If multi-select is not in effect, this function returns the full path and name of the single file or folder chosen by the user, or an empty string if the user cancels the dialog.
ja: マルチセレクトが有効でない場合、この関数は、ユーザーが選択した単一のファイルまたはフォルダのフルパスと名前を返し、ユーザーがダイアログをキャンセルした場合は空の文字列を返します。

source: If multiple callbacks have been registered for an event, a callback may return a non-empty value to prevent any remaining callbacks from being called.
ja: イベントに対して複数のコールバックが登録されているときは、コールバックは空でない値を返し、残りのコールバックが呼ばれないようにすることができます。

source: If multiple instances of the script are started simultaneously, they may fail to detect each other or may all target the same previous instance.
ja: 複数のスクリプトを同時に起動した場合、互いを検出できなかったり、すべてのインスタンスが同じ前のインスタンスをターゲットにしたりすることがあります。

source: If multiple lines are required, use braces to mark the start and end of the hotkey's action.
ja: 複数行が必要な場合は、中括弧を使ってホットキーの動作の開始と終了をマークしてください。

source: If multiple windows match WinTitle and any other criteria, the topmost matching window is used.
ja: 複数のウィンドウがWinTitleとその他の条件に一致する場合、一番上のウィンドウが使用される。

source: If needed, separate multiple commands and expressions with `n.
ja: 必要であれば、複数のコマンドや式を`nで区切ってください。

source: If needed, the value returned from the above variables can be manipulated by including at the end of the built-in variable name before the ending %, up to 2 parameters (called p2 and p3) all separated by tilde ~.
ja: 必要であれば、上記の変数から返される値は、組み込み変数名の末尾の%より前に、チルダ~で区切られた2つまでのパラメータ（p2とp3と呼ばれる）を含めることで操作できる。

source: If negative, the absolute value is assumed to be the resource ID of an icon within an executable file.
ja: 負の場合、絶対値は実行ファイル内のアイコンのリソースIDとみなされる。

source: If no Call is defined or inherited, Get may be called to retrieve a function object, which is then called.
ja: Callが定義または継承されていない場合、Getを呼び出して関数オブジェクトを取得し、その関数オブジェクトを呼び出すことができます。

source: If no Get is defined or inherited but there is a Call accessor function, the function itself becomes the property's value (read-only).
ja: Getが定義または継承されていないが、Callアクセサ関数が存在する場合、その関数自体がプロパティの値となります（読み取り専用）。

source: If no Set or value is defined or inherited, attempting to set the property will throw an exception.
ja: Setや値が定義されていない、または継承されていない場合、プロパティを設定しようとすると例外が発生します。

source: If no Encoding is specified, the string is simply copied without any conversion taking place.
ja: Encodingが指定されていない場合、文字列は変換されずに単にコピーされる。

source: If no Encoding is specified, the string is simply copied or measured without any conversion taking place.
ja: Encodingが指定されていない場合、文字列は変換されることなく、単にコピーまたは測定される。

source: If no classes are specified, the default is Error.
ja: クラスが指定されていない場合、デフォルトはErrorです。

source: If no ending character was required (due to the * option), this variable will be blank.
ja: 終了文字が必要ない場合（*オプションのため）、この変数は空白になる。

source: If no ending character was required (due to the * option), it will be blank.
ja: 終端文字が必要ない場合（*オプションのため）、空白となります。

source: If no entry or tab is selected, the return value is 0.
ja: エントリまたはタブが選択されていない場合、戻り値は 0 です。

source: If no explicit path was specified for DllFile, the file must exist in the system's PATH or A_WorkingDir.
ja: DllFileに明示的なパスが指定されていない場合、そのファイルはシステムのPATHまたはA_WorkingDirに存在する必要があります。

source: If no extension is supplied, .bin is assumed.
ja: 拡張子が与えられない場合は、.binとみなされる。

source: If no file or folder is found, an empty string is returned.
ja: ファイルやフォルダが見つからない場合は、空の文字列が返されます。

source: If no files were found, an error is thrown only if SourcePattern lacks the wildcards * and ?.
ja: ファイルが見つからなかった場合、SourcePatternにワイルドカード*と?がない場合のみ、エラーが発生します。

source: If no files were found, an exception is thrown only if SourcePattern lacks the wildcards * and ?.
ja: ファイルが見つからなかった場合、SourcePatternにワイルドカード*と?がない場合のみ、例外が発生します。

source: If no folder is found, an empty string is returned.
ja: フォルダが見つからない場合は、空の文字列が返されます。

source: If no function can be found by the given name, a "W" (Unicode) suffix is automatically appended.
ja: 指定された名前の関数が見つからない場合は、自動的に「W」（ユニコード）の接尾辞が付加されます。

source: If no item is selected, a ComboBox will still store the text of its edit field.
ja: 項目が選択されていない場合でも、コンボボックスはその編集フィールドのテキストを保存します。

source: If no match is found there, the search continues toward Y2, row by row, until it finds a matching pixel.
ja: そこで一致する画素が見つからなければ、一致する画素が見つかるまで、Y2に向かって1行ずつ検索を続けます。

source: If no match is found, an exception is thrown.
ja: 一致しない場合は、例外がスローされます。

source: If no matching file is found there, the system will search for and launch the file if it is integrated ("known"), e.g. by being contained in one of the PATH folders.
ja: そこに一致するファイルが見つからない場合、PATHフォルダの1つに含まれているなど、統合されている（「既知」）場合は、そのファイルを検索して起動します。

source: If no name is specified, the .exe will have the default name.
ja: 名前を指定しない場合、.exeはデフォルトの名前になる。

source: If no path is specified, the .exe will be created in the script folder.
ja: パスが指定されていない場合、.exeはスクリプト・フォルダーに作成されます。

source: If no replacements are needed, Haystack is returned unaltered.
ja: 交換の必要がない場合は、Haystackはそのまま返却されます。

source: If no such method exists, the object itself is assumed to be an enumerator object.
ja: そのようなメソッドが存在しない場合、オブジェクト自体が列挙者オブジェクトであるとみなされます。

source: If no such property exists, a PropertyError is thrown.
ja: そのようなプロパティが存在しない場合、PropertyErrorが投げられる。

source: If no text is selected, an empty string is returned.
ja: テキストが選択されていない場合は、空の文字列が返されます。

source: If non-zero, the string is split a maximum of MaxParts-1 times and the remainder of the string is returned in the last substring (excluding any leading or trailing OmitChars).
ja: 0でない場合、文字列は最大MaxParts-1回分割され、文字列の残りが最後の部分文字列として返される(先頭または末尾のOmitCharsを除く)。

source: If none is selected, zero is returned.
ja: 何も選択されていない場合は、0が返されます。

source: If none of the above options are used, the default mode is SendInput.
ja: 上記のオプションを使用しない場合、デフォルトのモードはSendInputです。

source: If none of the target window's controls has focus, the return value is 0.
ja: 対象ウィンドウのどのコントロールにもフォーカスがない場合、戻り値は 0 となる。

source: If none of these options is present, the new item is added as the last/bottom sibling.
ja: これらのオプションがない場合、新しい項目は最後/最下部の兄弟として追加されます。

source: If none, the return value is blank.
ja: ない場合は、空白を返します。

source: If not disabled, a warning is given for the first non-dynamic reference to each variable which is never used as the target of a direct, non-dynamic assignment or the reference operator (&), or passed directly to IsSet.
ja: 無効化されていない場合、各変数への最初の非動的参照で、直接の非動的代入や参照演算子（&）の対象として使用されたり、IsSetに直接渡されたりすることがない場合に警告が表示されます。

source: If not explicitly covered above, it is safe to assume the string is temporary.
ja: 上記で明示的にカバーされていない場合、文字列は一時的なものだと考えて差し支えない。

source: If not found there, it searches for it in the user library, and then the standard library.
ja: そこで見つからなければ、ユーザー・ライブラリーを探し、次に標準ライブラリーを探す。

source: If not omitted, Options must be a space- or tab-delimited list of one or more of the following options:
ja: 省略されない場合、Optionsは、以下のオプションの1つ以上をスペースまたはタブで区切ったリストでなければならない：

source: If not otherwise set by the script, the default is CP0.
ja: スクリプトで他に設定されていない場合、デフォルトはCP0です。

source: If not set by the auto-execute thread, the standard defaults will apply (as documented on each of the following pages):
ja: 自動実行スレッドによって設定されていない場合は、標準のデフォルトが適用される（以下の各ページに記載）：

source: If not set by the auto-execute thread, the standard defaults will apply (as documented on each of the following pages): CoordMode, Critical, DetectHiddenText, DetectHiddenWindows, FileEncoding, ListLines, SendLevel, SendMode, SetControlDelay, SetDefaultMouseSpeed, SetKeyDelay, SetMouseDelay, SetRegView, SetStoreCapsLockMode, SetTitleMatchMode, SetWinDelay, and Thread.
ja: 自動実行スレッドによって設定されていない場合は、標準のデフォルトが適用される（以下の各ページに記載）：CoordMode、Critical、DetectHiddenText、DetectHiddenWindows、FileEncoding、ListLines、SendLevel、SendMode、SetControlDelay、SetDefaultMouseSpeed、SetKeyDelay、SetMouseDelay、SetRegView、SetStoreCapsLockMode、SetTitleMatchMode、SetWinDelay、Thread。

source: If not set by the script, it defaults to the file name of the current script, without its path, e.g. MyScript.ahk.
ja: スクリプトによって設定されていない場合、デフォルトは現在のスクリプトのファイル名で、パスは省略される。

source: If not specified by an #InputLevel directive, hotkeys and hotstrings default to level 0.
ja: #InputLevelディレクティブで指定されていないときは、ホットキーとホットストリングのデフォルトはレベル0になります。

source: If nothing is selected, the function name will be extracted from the beginning of the current line.
ja: 何も選択されていなければ、現在の行の先頭から関数名が抽出される。

source: If omitted (or if the parameter count was not verified), a basic check is performed for a Call method to verify that the object is most likely callable.
ja: 省略したとき、またはパラメータ数が確認されなかったときは、オブジェクトが呼び出し可能である可能性が高いことを確認するために、Callメソッドに対して基本的なチェックが実行されます。

source: If omitted entirely, the default is to share all access.
ja: 完全に省略された場合、デフォルトはすべてのアクセスを共有します。

source: If omitted or 0 (false), the function does not overwrite existing files.
ja: 省略時または 0（false）の場合、既存ファイルの上書きを行わない。

source: If omitted or 0, the function uses the default method to determine OutputVarControl and stores the control's ClassNN.
ja: 省略時または 0 の場合、デフォルトの方法でOutputVarControlを決定し、コントロールの ClassNN を保存します。

source: If omitted or 1 (true), the window will be hidden.
ja: 省略時または 1（true）の場合、ウィンドウは非表示となる。

source: If omitted or 1, this statement applies to the innermost loop in which it is enclosed.
ja: 省略したとき、または1のときは、この文が囲まれている最も内側のループに適用されます。

source: If omitted or blank, 1 click is sent.
ja: 省略または空白の場合は、1クリック送信されます。

source: If omitted or blank, an interface implemented by the device itself is retrieved.
ja: 省略または空白の場合、デバイス自身が実装しているインターフェイスが検索される。

source: If omitted or blank, it defaults to the system's default device for playback (which is not necessarily device 1).
ja: 省略または空白の場合、デフォルトはシステムのデフォルト再生デバイス（デバイス1とは限らない）となる。

source: If omitted or blank, it will default to "Select File - " A_ScriptName (i.e. the name of the current script), unless the "D" option is present, in which case the word "File" is replaced with "Folder".
ja: 省略または空白の場合、デフォルトで"ファイルを選択 - "A_ScriptName（つまり、現在のスクリプトの名前）"となります。"D"オプションが存在する場合、"File"は "Folder"に置き換えられます。

source: If omitted or blank, it will default to "Select Folder - " A_ScriptName (i.e. the name of the current script).
ja: 省略または空白の場合、デフォルトで"フォルダを選択 - "A_ScriptName（つまり、現在のスクリプトの名前）が表示されます。

source: If omitted or blank, the LEFT button will be used.
ja: 省略または空白の場合、LEFTボタンが使用されます。

source: If omitted or blank, the function targets the master volume/mute controls or an interface that can be returned by IMMDevice::Activate.
ja: 省略または空白の場合、この関数はマスターボリューム/ミュートコントロールまたはIMMDevice::Activateが返すことができるインターフェイスを対象とします。

source: If omitted or blank, the function will not wait at all.
ja: 省略または空白の場合、関数はまったく待機しない。

source: If omitted or blank, the master mute setting is changed.
ja: 省略または空白の場合、マスターミュートの設定が変更される。

source: If omitted or blank, the master mute setting is retrieved.
ja: 省略または空白の場合、マスターミュート設定が取得される。

source: If omitted or blank, the master volume setting is changed.
ja: 省略または空白の場合、マスターボリュームの設定が変更されます。

source: If omitted or blank, the master volume setting is retrieved.
ja: 省略または空白の場合、マスターボリュームの設定が取得される。

source: If omitted or blank, the name of the device itself is retrieved.
ja: 省略または空白の場合、デバイス自体の名前が取得される。

source: If omitted or blank, the starting directory will be a default that might depend on the OS version (it will likely be the directory most recently selected by the user during a prior use of FileSelect).
ja: 省略または空白の場合、開始ディレクトリはOSのバージョンに依存するデフォルトとなります（おそらく、以前にFileSelectを使用した際に、ユーザーが最も最近選択したディレクトリとなるでしょう）。

source: If omitted or empty, any string passed to OnEvent's Function parameter is interpreted as a function name.
ja: 省略または空の場合、OnEventのFunctionパラメータに渡された文字列は、関数名として解釈されます。

source: If omitted or less than 1, the search begins at the top of the list.
ja: 省略された場合、または1未満の場合は、リストの先頭から検索を開始します。

source: If omitted when updating a menu item, the item's priority will not be changed.
ja: メニュー項目を更新する際に省略した場合、その項目の優先順位は変更されません。

source: If omitted, 0 will be used.
ja: 省略された場合は、0が使用されます。

source: If omitted, Boolean indicates whether the function has any ByRef parameters.
ja: 省略された場合、Booleanは、関数が ByRef パラメータを持つかどうかを示します。

source: If omitted, Boolean indicates whether the function has any optional parameters.
ja: 省略された場合、Booleanは、関数が任意のパラメータを持つかどうかを示します。

source: If omitted, ExitCode defaults to zero.
ja: 省略された場合、ExitCodeのデフォルトは0です。

source: If omitted, Value itself is checked whether it is callable.
ja: 省略したときは、Value自体が呼び出し可能かどうかをチェックします。

source: If omitted, Origin defaults to SEEK_END when Distance is negative and SEEK_SET otherwise.
ja: 省略された場合、Originのデフォルトは、Distanceが負の場合はSEEK_END、それ以外はSEEK_SETとなります。

source: If omitted, all items in the TreeView are deleted.
ja: 省略された場合、TreeViewのすべてのアイテムが削除されます。

source: If omitted, Ahk2Exe automatically detects the type according to the file extension.
ja: 省略された場合、Ahk2Exeはファイルの拡張子によって自動的にタイプを検出します。

source: If omitted, a sign appears only for negative signed values (-).
ja: 省略した場合は、負の符号付き値（-）に対してのみ符号が表示されます。

source: If omitted, all drive types are retrieved.
ja: 省略した場合は、すべてのドライブタイプを取得します。

source: If omitted, all entries are deleted.
ja: 省略された場合は、すべてのエントリーが削除されます。

source: If omitted, an OSError is thrown instead of returning a default value.
ja: 省略された場合、デフォルト値を返す代わりにOSErrorが投げられる。

source: If omitted, an OSError is thrown on failure.
ja: 省略したときは、失敗時にOSErrorがスローされます。

source: If omitted, each click will consist of a "down" event followed by an "up" event.
ja: 省略した場合、各クリックは "下 "イベントと "上 "イベントから構成されます。

source: If omitted, each parameter defaults to 0.
ja: 省略された場合、各パラメータのデフォルトは 0 です。

source: If omitted, it defaults to "all characters".
ja: 省略したときは、"全ての文字"が初期値になります。

source: If omitted, it defaults to -1, which replaces all occurrences of the pattern found in Haystack.
ja: 省略すると、初期値は-1となってHaystack で見つかったすべてが置き換えられます。

source: If omitted, it defaults to -1.
ja: 省略したときの初期値は-1です。

source: If omitted, it defaults to 0 (false).
ja: 省略された場合、デフォルトは0（false）です。

source: If omitted, it defaults to 0 (wait only for text or files).
ja: 省略されたときの初期値は0です。（テキストかファイルのみ対象）

source: If omitted, it defaults to 0 (zero is traditionally used to indicate success).
ja: 省略されたときは、初期値は0になります。0は伝統的に処理に成功したことを示します。

source: If omitted, it defaults to 0, meaning the function uses the default method to determine OutputVarControl and stores the control's ClassNN.
ja: 省略したときは既定値は0になり、関数は既定のメソッドを使用して OutputVarControl を決定し、コントロールのClassNNを格納します。

source: If omitted, it defaults to 0, which is no icon.
ja: 省略された場合、デフォルトは0となり、アイコンは表示されない。

source: If omitted, it defaults to 0.
ja: 省略したときの初期値は0です。

source: If omitted, it defaults to 1 (call the callback after any previously registered callbacks).
ja: 省略された場合、デフォルトは1（以前に登録されたコールバックの後にコールバックを呼び出す）です。

source: If omitted, it defaults to 1 (call the function after any previously registered functions).
ja: 省略した場合、デフォルトは1（以前に登録された関数の後に呼び出す）です。

source: If omitted, it defaults to 1 (normal).
ja: 省略された場合、デフォルトは1（通常）です。

source: If omitted, it defaults to 1 (the text in the first column).
ja: 省略された場合、デフォルトは1（1列目のテキスト）です。

source: If omitted, it defaults to 1, which is usually the part that contains the text of interest.
ja: 省略されたときは、初期値は1になります。

source: If omitted, it defaults to 1.
ja: 省略したときは、初期値は 1 です。

source: If omitted, it defaults to 150.
ja: 省略しゃれたときは、初期値は150です。

source: If omitted, it defaults to 2.
ja: 省略しゃれたときは、初期値は2です。
